{"pageProps":{"posts":[{"title":"8 웹에서 JS를 사용하여 공유하기 고급 기능 UriBaba","description":"","date":"2024-06-19 00:19","slug":"2024-06-19-8ShareintheWebUsingJSAdvancedFeatureUriBaba","content":"\n\n## 고급 JavaScript 기능으로의 심층 탐구\n\n![이미지](/assets/img/2024-06-19-8ShareintheWebUsingJSAdvancedFeatureUriBaba_0.png)\n\n자바스크립트는 많이 발전해 왔으며 세계에서 널리 사용되는 언어 중 하나입니다. 이 기사에서는 고급 자바스크립트를 사용하여 웹에서 공유 기능에 대해 논의합니다. 이 기능을 사용하면 핸드폰의 앱 목록을 열고 사용자가 어떤 앱에서든 공유할 수 있습니다. 코드와 함께 놀아봅시다.\n\n여러 브라우저에서 실패할 수 있기 때문에 Web API의 지원을 확인하고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n```js\n// window 대신 globalThis를 사용할 수 있어요\nconst isBrowserSupport = () => globalThis.navigator?.share;\n```\n\n웹 공유 API는 web-share 권한 정책에 의해 제한됩니다. 권한은 지원되지만 부여되지 않았을 경우 canShare() 메서드는 false를 반환할 것입니다.\n\n```js\nconst isShareAPIDataValid = (sharingData) => {\n  if (navigator.canShare) {\n    return navigator.canShare(sharingData);\n  }\n  \n  return true;\n};\n```\n\n그 다음 단계에서는 navigator.share를 사용하여 휴대폰 앱 목록을 열어서 사용자가 어떤 앱에서든 공유할 수 있도록 합시다.\n\n<div class=\"content-ad\"></div>\n\n```js\nconst sharingData = { \n  title: '제목', \n  text: '설명', \n  url: 'https://medium.com/@opensrc0/5-scanner-qr-bar-code-upi-in-the-web-using-js-advanced-feature-uribaba-8407f08ddefd' \n};\n\nnavigator.share(sharingData)\n  .then(() => console.log(sharingData))\n  .catch((error) => console.log(error));\n```\n\n여기까지입니다. 정말 멋지죠. JavaScript의 고급 기능인 navigator.share를 사용하여 웹에서 공유 기능이 가능합니다. 아래는 결합된 코드입니다.\n\n```js\nconst isBrowserSupport = () => globalThis.navigator?.share;\n\nconst isShareAPIDataValid = (sharingData) => {\n  if (navigator.canShare) {\n    return navigator.canShare(sharingData);\n  }\n  \n  return true;\n};\n\nif (isBrowserSupport()) {\n  if (isShareAPIDataValid(sharingData)) {\n    navigator.share(sharingData)\n      .then(() => console.log('성공'))\n      .catch((e) => console.log('오류'));\n  } else {\n    console.log('허가 거부');\n  }\n} else {\n  console.log('지원하지 않는 기능');\n}\n```\n\n![이미지](/assets/img/2024-06-19-8ShareintheWebUsingJSAdvancedFeatureUriBaba_1.png)\n\n\n<div class=\"content-ad\"></div>\n\n웹 개발을 fe-pilot npm 패키지로 업그레이드하세요! https://github.com/opensrc0/fe-pilot\n\nReact로 개발된 이 혁신적인 JavaScript 라이브러리는 웹 애플리케이션을 한 단계 높여주는 최신 기능을 제공합니다. fe-pilot은 일반적으로 많은 코딩 노력이 필요한 고급 기능을 쉽게 통합하는 프로세스를 간소화합니다.\n\n# 유용한 링크:\n\n7. 이미지 처리 및 QR 코드/바코드/UPI 세부 정보 가져오기: https://medium.com/@opensrc0/7-scanning-an-image-qr-bar-code-upi-in-the-web-using-js-advanced-feature-uribaba-d491139f5c02\n\n<div class=\"content-ad\"></div>\n\n8. 지금은 Share Features를 읽고 계십니다.\n\n9. Whatsapp Share: [https://medium.com/@opensrc0/9-whatsapp-share-in-the-web-using-js-advanced-feature-uribaba-919fe89c1840](https://medium.com/@opensrc0/9-whatsapp-share-in-the-web-using-js-advanced-feature-uribaba-919fe89c1840)","ogImage":{"url":"/assets/img/2024-06-19-8ShareintheWebUsingJSAdvancedFeatureUriBaba_0.png"},"coverImage":"/assets/img/2024-06-19-8ShareintheWebUsingJSAdvancedFeatureUriBaba_0.png","tag":["Tech"],"readingTime":3},{"title":"아웃시스템 UI를 사용자 정의하는 포괄적인 CSS 가이드","description":"","date":"2024-06-19 00:17","slug":"2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI","content":"\n\n모든 아웃시스템 열정가가 일생 동안 한 가지 일이 있다면 무엇일까요? 네, 있습니다. 아웃시스템 UI를 기반으로 응용 프로그램의 외관을 사용자 정의하는 것입니다.\n\n리액티브 웹 앱을 생성할 때, 예제 화면, 템플릿 및 구성 요소가 준비되어 있어 실제 사용 사례에 배포하고 사용할 수 있습니다. 화면에는 버튼, 아이콘, 글꼴, 색상, 테두리 등이 들어 있어 회사가 필요로 하는 기능을 완벽하게 제공합니다.\n\n다음 단계는 회사의 사내 정체성에 따라 응용 프로그램을 사용자 정의하는 것입니다. 아웃시스템 UI에서 기본 스타일링이 제공되는데, 사용자 정의 CSS를 추가하여 응용 프로그램의 시각적 외관을 사용자 정의할 수 있습니다.\n\n아웃시스템 UI의 기본 테마를 올바르게 덮어쓰기 위해서는 브라우저가 CSS를 렌더링하는 방식을 이해해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n# 시작부터 시작해봅시다\n\n먼저 MyDreamApp이라는 새 모듈을 만들고 Screen1이라는 빈 화면을 생성할 거예요.\n\n제가 기존부터 새로운 반응형 웹 앱을 만들 때, 플랫폼은 자동으로 모듈에 2가지 테마를 추가해요.\n\nOutSystems UI 테마에는 내장된 구성 요소를 위한 모든 CSS가 포함되어 있고, MyDreamApp 테마에는 우리가 직접 만든 CSS 코드를 넣을 거예요.\n\n<div class=\"content-ad\"></div>\n\n기본적으로, 우리는 MyDreamApp 테마를 진입점으로 갖고 있습니다. 이 테마는 OutSystemsUI 테마로 정의되어 있습니다.\n\n![이미지](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_0.png)\n\n이 Base 테마 접근 방식을 사용하면 여러 개의 테마가 순차적으로 로드될 수 있습니다.\n\n브라우저에서 Screen1을 렌더링할 때 미리 작성된 많은 CSS가 이미 함께 제공된다는 것을 확인할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n이 표를 분석해보겠습니다.\n\n## _Basics.css\n\n_Basics.css 파일은 플랫폼 코어에서 가져왔어요.\n플랫폼 화면이 올바르게 렌더링되는 데 중요한 CSS 클래스가 처리되는 곳이에요. .OSInline, .OSFillParent 또는 .feedback-message와 같은 것들이 여기에서 정의되어 있어요.\n\n## OutSystemsReactWidgets.css\n\n<div class=\"content-ad\"></div>\n\n플랫폼 코어의 다른 파일은 OutSystemsReactWidgets.css입니다.\n이 CSS 파일에서 플랫폼은 컨테이너, 목록, 입력란, 스위치, 표현식과 같은 위젯들의 스타일링을 다룹니다. 이 위젯들은 Service Studio 툴박스에서 얻을 수 있습니다. 이 위젯들은 OutSystems를 사용하여 개발된 것이 아니라 React 하이코드로 개발되었습니다.\n\n이것들은 필수적인 CSS 파일이며, 우리 애플리케이션에서 제거할 수 없습니다. 이 파일들은 제품 개발을 담당하는 내부 OS 팀에 의해 유지됩니다.\n\n## OutSystemsUI.css\n\n이제 우리는 OutSystems 세계에 들어갑니다. OutSystemsUI.css는 거의 20,000 줄의 CSS 코드를 포함하며, OSUI 키트의 모든 것, 레이아웃 및 패턴, 수정자 클래스, 색상, 크기 등이 스타일링되는 곳입니다.\n\n<div class=\"content-ad\"></div>\n\n위 모든 구성 요소는 OutSystems의 로우 코드를 사용하여 개발되었으며, 플랫폼을 즉시 사용하고 기록 시간에 애플리케이션을 생성할 수 있는 가속기 역할을 합니다.\n\n## MyDreamApp.extra.css\n\nOutSystems는 레이아웃과 화면을 구축하기 위해 간단한 열 기반 접근 방식을 사용합니다. 우리는 열의 수를 구성하고 전체 너비인지 또는 고정 너비인지를 결정하며, Service Studio는 이러한 모든 설정을 MyDreamApp.extra.css 파일에 저장합니다.\n\n![The Comprehensive CSS Guide for Customizing OutSystems UI](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_1.png)\n\n<div class=\"content-ad\"></div>\n\n\"If we set Grid Type to (None), this file is not created.\n\n## MyDreamApp.css\n\nFinally, only one file remains: MyDreamApp.css. This is where we will do most of our work and write custom CSS to override OutSystems UI default styling.\"\n\n<div class=\"content-ad\"></div>\n\n테마 편집기를 사용하여 몇 가지 설정을 사용자 정의하면, Service Studio가 CSS 변수를 생성하여 MyDreamApp.css 파일 안에 배치할 것입니다. 이러한 변수들은 우리 애플리케이션의 전반적인 모양과 느낌에 영향을 미칠 것입니다.\n\n![이미지](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_2.png)\n\n![이미지](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_3.png)\n\nOutSystemsUI.css에도 동일한 CSS 변수들이 포함되어 있으며, 테마 편집기에 의해 사용자 정의할 수 있습니다. 또한, 모든 변수에 대한 미리 작성된 기본값이 있습니다.\n\n<div class=\"content-ad\"></div>\n\nMyDreamApp.css 파일이 OutSystemsUI.css 파일보다 늦게 로드되기 때문에 우리의 사용자 정의 CSS 변수가 OSUI에서 오는 변수를 덮어씁니다.\n\n이러한 변수들은 :root 요소에 적용되기 때문에 글로벌입니다.\n\n테마 편집기에서 모든 스타일을 재설정하면 MyDreamApp.css 파일이 완전히 비어있게 됩니다.\n\n이제 기본 제공 파일을 이해했으니 우리는 그것들을 재정의할 준비를 할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\nOutSystems 플랫폼에서 많은 것들과 마찬가지로 CSS를 빠르게 많이 작성하는 것이 쉽습니다. 그러나 많은 작업을 하는 것이 모든 것을 잘 해결한다는 것을 의미하지는 않습니다. 그러므로 CSS가 실제로 어떻게 작동하는 지 알아보도록 하겠습니다.\n\n# CSS가 작동하는 방식\n\nOutSystems UI 테마를 가장 효과적으로 재정의하려면 다음과 같이 세 가지 CSS 주제에 대해 이야기해야 합니다:\n\n- 캐스케이딩\n- 상속\n- 특이성\n\n<div class=\"content-ad\"></div>\n\n# 계단식\n\nCSS에서의 \"cascading(계단식)\"은 스타일 규칙이 여러 소스에서 \"cascade(폭포처럼)\" 내려간다는 사실을 의미합니다. 이는 CSS에는 내재된 계층 구조가 있어 우선순위가 높은 스타일이 우선순위가 낮은 규칙을 덮어 씁니다.\n\n다음 예제를 분석해 봅시다:\n\n```js\n// first.css 파일\nh1 {\n  font-family: \"Courier New\";\n  color: red;\n}\n\n// second.css 파일\nh1 {\n  color: green;\n}\n```\n\n<div class=\"content-ad\"></div>\n\n다음은 `h1` 요소에 대한 계산된 스타일 결과입니다:\n\n```js\ncolor: green;\ndisplay: block;\nfont-family: \"Courier New\";\nfont-size: 2em;\nfont-weight: 700;\n// ... 몇 가지 더\n```\n\n여기 몇 가지 주요 개념을 확인해 보겠습니다:\n\n- \"green\" 색상은 \"red\" 색상 뒤에 나오기 때문에 우선권을 갖습니다\n(그래서 CSS 파일을 작성하거나 가져올 때 순서가 중요한 이유입니다)\n- 요소는 다른 셀렉터에서 여러 속성을 추가할 수 있습니다\n(모두 요소에 추가되어 적용됩니다)\n- HTML 요소에는 사용자 에이전트가 정의한 기본 속성이 있습니다\n(이것이 브라우저 간에 차이가 나는 이유 중 하나입니다)\n\n<div class=\"content-ad\"></div>\n\n# 상속\n\nCSS의 맥락에서 상속은 HTML 요소의 특정 스타일 속성이 해당 요소의 하위 요소로 전달되는 과정입니다.\n\n다음 속성들이 이에 해당합니다:\n\n- color\n- font-family\n- font-size\n- font-style\n- font-weight\n- text-align\n- (다른 많은 속성들...)\n\n<div class=\"content-ad\"></div>\n\n자손들에게 상속됩니다.\n\n따라서 `body`에 색상이나 글꼴 크기를 설정하면 그 설정에 영향을 받는 모든 하위 요소에 영향을 줍니다.\n\n이 동작은 매우 유용하지만 오용 시 매우 위험할 수도 있습니다.\n예를 들어, 요소에 text-align: center를 사용하면 모든 하위 HTML 노드도 중앙 정렬됩니다.\n\n다른 속성은 다중상속되지 않으며 각 요소마다 명시적으로 정의해야 합니다. 이에는 다음이 포함됩니다:\n\n<div class=\"content-ad\"></div>\n\n- 배경색\n- 테두리\n- 표시\n- 여백\n- 안쪽여백\n- (다른 많은 항목들…)\n\n# 특이성\n\n가장 중요하면서도 재미있게 다루는 항목입니다.\n\n특이성은 브라우저가 요소에 적합한 CSS 선언을 결정하는 알고리즘이며, 이는 다시 요소에 적용할 속성 값을 결정합니다.\n\n<div class=\"content-ad\"></div>\n\n다음 3개의 열을 고려해 봅시다: a, band c.\n\n![image](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_4.png)\n\n특이성은 각 열의 선택자 수를 세어 세 부분 값으로 형성됩니다. 다음은 작동 방식입니다:\n\n- ID 선택자: 각 id 선택자에 1을 a 값에 추가합니다.\n- 클래스 선택자, 속성 선택자 및 가상 클래스: 각각에 1을 b 값에 추가합니다.\n- 유형 선택자 및 가상 요소: 각각에 1을 c 값에 추가합니다.\n\n<div class=\"content-ad\"></div>\n\n가장 구체적인 예를 몇 가지 살펴봅시다:\n\n- body .wrapper #header ' '\n특이성: (1, 1, 1)\n- #main ' '\n특이성: (1, 0, 0)\n- .container .content ' '\n특이성: (0, 2, 0)\n- div ' '\n특이성: (0, 0, 1)\n\n전체 선택자 *, 결합자 +, `, ~ 및 부정 가상 클래스 :not는 그 자체로 특이성을 추가하지 않습니다.\n\n동일한 요소에 여러 CSS 규칙이 적용되는 경우 특이성이 가장 높은 규칙이 이길 것입니다. 특이성 값이 동일한 경우 CSS 파일에서 마지막으로 선언된 규칙이 적용되며, 앞에서 언급한 계단식을 따릅니다.\n\n<div class=\"content-ad\"></div>\n\n## 인라인 스타일\n\n인라인 스타일은 특이성을 고려하지 않습니다. 왜냐하면 이들은 계층의 일찍 평가됩니다. 이들의 규칙은 특이성 알고리즘이 평가하는 것보다 우선합니다.\n\n## !important\n\nCSS 선택자에 !important를 사용하면 특이성이나 인라인 스타일에 관계없이 다른 규칙을 재정의합니다. 그러나 CSS를 유지하는데 더 어렵게 만들기 때문에 조심해서 사용해야 합니다. 이것은 모든 것의 어머니입니다.\n\n<div class=\"content-ad\"></div>\n\n# 개발자 도구\n\n브라우저 개발자 도구는 CSS가 브라우저에서 어떻게 렌더링되는지 이해하는 데도 큰 도움이 됩니다.\n\n다음 이미지를 분석해 봅시다. 동일한 파일인 OutSystemsUI.css에서 여러 CSS 선택자들이 있습니다:\n\n![OutSystemsUI CSS Image](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_5.png)\n\n<div class=\"content-ad\"></div>\n\n일부 중요한 개념들:\n\n- CSS 선택자는 선택된 요소에 적용되는 순서대로 위에서 아래로 표시됩니다;\n- CSS 선택자에 마우스를 올리면 브라우저가 계산된 특이성을 표시합니다. (0, 4, 1)이 어떻게 계산되었는지 이해할 수 있나요?\n- 1845번 라인의 CSS 선택자(0,3,0)가 9419번 라인의 것(0,2,1)보다 더 구체적이며 그래서 계층구조에서 뒤에 위치합니다.\n\n그러니 브라우저 개발자 도구를 열어 CSS가 실제로 해석되는 방법을 이해하는 데 궁극적인 도움을 받아보세요.\n\n# 그 다음에는 무엇을 해볼까요?\n\n<div class=\"content-ad\"></div>\n\nCSS 작성을 시작해보세요!\n\n수정하고 싶은 속성을 식별한 다음, Developer Tools를 확인하여 대상이 되는 OutSystems UI CSS 클래스를 확인하세요.\n\n우리가 작성한 사용자 정의 테마 파일 MyDreamApp.css는 OutSystemsUI.css 이후에 로드됩니다. 이는 같은 특이성을 갖는 규칙은 나중에 로드되므로 우선적으로 적용됨을 의미합니다.\n\n하지만 이것만으로 OSUI 코드의 모든 것을 무시할 수 있는 것은 아닙니다.\n\n<div class=\"content-ad\"></div>\n\n코드가 실제로 적용되려면 더 높은 구체성이 필요합니다.\n\n이제 진짜 의미를 알게 되었어요. 😄\n\n# 몇 가지 조언\n\n- 불필요한 CSS 선택자를 작성하거나 OSUI에서 완전한 규칙을 코드베이스로 직접 복사하는 것을 피하세요. 때로는 OSUI 팀이 릴리스 사이에 구성 요소 구조를 변경하고 규칙이 작동을 멈출 수 있습니다. 절대 필요한 최소한만 사용하세요.\n- 재사용 가능한 CSS 클래스를 만들고 구성 요소에 적용하여 사용자 정의 코드를 내부에 유지하세요.\n- 래퍼 CSS 클래스만 있으면(예: 레이아웃에) b 구체성 열에 1 포인트를 추가하고 그 안의 모든 것을 대상으로 지정하고 재정의할 수 있습니다.\n- 가능한 경우 수정자 CSS 클래스와 함께 ExtendedClass 입력 매개변수를 사용하세요.\n때로는 CSS를 전혀 작성할 필요가 없을 수도 있어요. 😎\nOutSystems UI에서 이미 사용 가능한 유틸리티 클래스와 CSS 변수를 확인해보세요. 🤩 https://outsystemsui.outsystems.com/OutSystemsUIWebsite/CheatSheet\n\n<div class=\"content-ad\"></div>\n\n# 결론\n\nOutSystems UI 킷은 사용 준비가 되어 있어서 그대로 사용하면 아름다운 애플리케이션을 만들 수 있습니다.\n\n하지만 모든 제품이 같은 모습이어야 하는 것은 아닙니다! 때때로 우리는 애플리케이션의 외관을 일부 CSS 코드로 사용자 정의해야 합니다.\n\n이 기사에 설명된 브라우저가 CSS를 렌더링하는 방법과 개념을 이해하면 OutSystems UI를 기반으로 한 애플리케이션의 외관을 최적화한 CSS 코드를 쓸 수 있어서 노력을 최소화하면서 애플리케이션의 외관을 수정할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n만약 이 글을 즐겼다면 👏 버튼을 눌러주세요.\n다른 글들도 확인하시고 댓글로 연락주세요!\n\n이 글이 도움이 되었다면, 더 많은 글을 쓸 동기부여가 되겠어요. 🥰\n\n![이미지](/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_6.png)","ogImage":{"url":"/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_0.png"},"coverImage":"/assets/img/2024-06-19-TheComprehensiveCSSGuideforCustomizingOutSystemsUI_0.png","tag":["Tech"],"readingTime":8},{"title":"플러터를 이용한 크로스 플랫폼 개발하기","description":"","date":"2024-06-19 00:16","slug":"2024-06-19-Cross-PlatformDevelopmentwithFlutter","content":"\n\n<img src=\"/assets/img/2024-06-19-Cross-PlatformDevelopmentwithFlutter_0.png\" />\n\n플러터(Flutter)는 Google에서 개발한 오픈 소스 프레임워크로, 모바일, 웹, 데스크톱 및 임베디드 장치용으로 아름다운 고성능 앱을 구축하는 데 사용됩니다. 그 핵심 장점은 무엇일까요? 하나의 코드베이스에서 이러한 애플리케이션을 만들 수 있다는 것입니다! 이는 빠른 개발, 쉬운 유지 보수 및 일관된 사용자 경험을 각 플랫폼에서 제공할 수 있음을 의미합니다.\n\n여기서 플러터가 크로스 플랫폼 개발에 좋은 선택인 이유를 살펴보겠습니다:\n\n- 하나의 코드베이스: 코드를 한 번 작성하고 iOS, Android, 웹, 데스크톱과 같은 여러 플랫폼에 배포하여 개발 시간과 비용을 줄일 수 있습니다.\n- 빠르고 효율적: Flutter는 부드러운 성능을 위해 Dart라는 현대적인 객체 지향 언어를 사용하고 원시 코드로 직접 컴파일합니다.\n- 핫 리로드: 거의 즉시 앱에 반영되는 코드 변경 사항을 볼 수 있어 개발 주기를 가속화합니다.\n- 아름다운 UI: 플러터는 각 플랫폼에서 네이티브처럼 보이며 놀라운 사용자 인터페이스를 디자인할 수 있는 풍부한 위젯과 도구를 제공합니다.\n- 선언적 UI: 어떻게 한 줄씩 구현하는 방법보다 UI가 어떻게 보여야 하는지에 집중할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n여기서는 크로스 플랫폼 개발에 Flutter를 사용하는 추가 혜택들을 소개해 드립니다:\n\n- 커다란 커뮤니티 및 리소스: Flutter는 개발자 커뮤니티가 활발하며 방대한 문서와 온라인 자습서, 리소스가 풍부합니다.\n- 복잡한 앱에 적합함: Flutter는 간단한 앱을 넘어서 복잡한 기능 및 통합을 처리할 수 있습니다.\n- 구글 지원: 구글의 지원 아래, Flutter는 지속적인 발전을 이루고 있으며 장기 프로젝트에 안정성과 신뢰성을 제공합니다.\n\nFlutter가 당신에게 적합한가요?\n\n다음 프로젝트에 Flutter를 고려해 보세요 만약:\n\n<div class=\"content-ad\"></div>\n\n- 고성능 앱을 다양한 플랫폼에 구축하고 싶어요.\n- 빠른 개발 주기와 효율적 코딩을 중요시합니다.\n- 아름답고 사용자 정의 가능한 UI를 우선시합니다.\n- 강력한 커뮤니티와 구글의 지원이 있는 프레임워크를 찾고 있습니다.\n\n플러터로 시작하기\n\n지금 바로 시작할 준비가 되셨나요? 아래는 시작하는 데 도움이 되는 자료들입니다:\n\n- 공식 플러터 웹사이트: https://flutter.dev/\n- 플러터 시작하기 튜토리얼: https://docs.flutter.dev/get-started/codelab\n- 플러터 문서: https://docs.flutter.dev/\n\n<div class=\"content-ad\"></div>\n\n플러터를 사용하면 개발 프로세스를 간소화하고 더 넓은 사용자에게 접근하며 모든 플랫폼용 탁월한 앱을 만들 수 있어요.","ogImage":{"url":"/assets/img/2024-06-19-Cross-PlatformDevelopmentwithFlutter_0.png"},"coverImage":"/assets/img/2024-06-19-Cross-PlatformDevelopmentwithFlutter_0.png","tag":["Tech"],"readingTime":2},{"title":"코틀린 멀티플랫폼이 플러터를 죽일까요","description":"","date":"2024-06-19 00:14","slug":"2024-06-19-IsKotlinMultiplatformkillingFlutter","content":"\n\n\n<img src=\"https://miro.medium.com/v2/resize:fit:1400/1*9tMerLCXlni2rnhmZXZKRQ.gif\" />\n\n현재 크로스 플랫폼 솔루션의 옵션들은 무수히 많습니다. 솔직히 말해서, 옳고 그른 것은 없죠. KMP와 Compose은 플러터에게 심각한 위협으로 보입니다. 하지만 걱정해야 할 문제인지, 또는 그들이 공존할 수 있는 중요한 차이가 있는지에 대해 이야기해 봐야 할 것 같습니다.\n\n언제나 그런 질문 중 하나죠: \"왜 플러터를 선택해야 하나요?\", \"플러터가 ...보다 뛰어나나요?\" 그리고 항상 다음과 같이 친절히 말씀드리겠습니다. (아니, Ionic이나 Cordova와 같은 웹 기반 프레임워크를 선택하지 않는 한) 옳고 그른 대답은 없다는 거 말이죠. (모바일 개발이라고 부를 수 있을까요?)\n\n저는 플러터를 좋아하지만, 만약 그게 무리하다면 강요하지는 않을 거에요. 이미 존재하는 제품, 기술 스택, 팀, 또는 스킬셋을 고려해보면 React Native와 같은 것을 사용하는 것이 더 합리적일 수 있어요. 그렇지 않으면 플러터 지식을 가진 새로운 개발자를 고용해야 하거나, 기존 팀에 교육을 받게 해야 하거나, 혹은 직접 공부를 해야 할 수도 있어요. 재미있긴 하지만, 비즈니스적으로 항상 합당한 이유는 아니거든요.\n\n\n<div class=\"content-ad\"></div>\n\n지금, Kotlin Multiplatform을 사용하면 다른 또 하나의 후보가 나타나면서 여러분에게 가장 먼저 선택받고 싶어합니다. 하지만 여러분은 그를 선택해야 하는 이유가 무엇일까요?\n\nKotlin Multiplatform은 안드로이드, iOS, 데스크톱 및 웹과 같이 여러 플랫폼에서 기능하며, 플러터와 같이 작동합니다. 그러나 이는 UI 프레임워크가 아닙니다. Kotlin Multiplatform을 사용하면 여러 플랫폼에 배포할 비즈니스 로직을 모두 작성할 수 있지만, 지원하려는 각 플랫폼마다 별도의 UI 레이어를 작성해야 합니다.\n반면 플러터는 비즈니스 로직부터 UI까지 코드를 한 번만 작성하고 각 플랫폼에 배포하는 완전한 크로스 플랫폼 프레임워크입니다.\n\n이 중요한 차이점이 여러분에게 명확한 선택을 제시하고, 그들의 조화로운 공존을 '증명'해줄 것입니다. 구글 자체도 이 분리와 기술 선택을 지지합니다:\n\n- 여러 플랫폼 간에 비즈니스 로직을 공유해야 한다면 Kotlin Multiplatform을 선택하세요.\n- 여러 플랫폼 간에 비즈니스 로직과 UI를 공유하고 모든 것에 대해 단일 코드베이스를 갖길 원한다면 플러터를 사용하세요.\n\n<div class=\"content-ad\"></div>\n\n## 그런데 Compose Multiplatform은 어떨까요?\n\nKotlin Multiplatform과 Flutter의 차이점은 명확하지만, JetBrains의 크로스 플랫폼 UI 기술인 Compose Multiplatform을 추가해보면 어떨까요?\n\n지금으로부터 Compose Multiplatform은 아직 진행 중인 프로젝트입니다. 안정적인 Android 및 데스크톱 플랫폼용으로 사용할 수 있지만, 웹에서는 알파 단계이며 iOS에서는 베타 단계입니다. 이런 의미에서 현재 플러터가 더 나은, 보다 성숙한 옵션임은 분명합니다. 그럼에도 Compose Multiplatform이 어떻게 발전해 나갈지 궁금합니다. 둘 다 캔버스에 픽셀을 그리는 기술을 사용한다는 점, React Native와 같은 프레임워크처럼 네이티브 컴포넌트로의 브리징이 아닌 점, 선언형 UI 및 강력한 유형 언어를 사용한다는 공통점이 있으며, 두 스택 모두 풀 스택 개발에 적합하며 기존 네이티브 앱과의 상호 운용성을 제공합니다. 비슷한 플랫폼에 공간이 있을까요?\n\n## 플러터를 버려야 할까요?\n\n<div class=\"content-ad\"></div>\n\nCompose Multiplatform은 확실히 유망해 보여요. Flutter가 어떻게 될지는 Flutter의 현재 채택 정도, 커뮤니티 지원과 참여(매우 좋은 편!), Compose의 추가 혜택과 성능, 그리고 Compose Multiplatform의 내부 아키텍처에 달려 있어요. Flutter는 새 플랫폼을 지원해야 할 때 작은 플랫폼별 레이어만 작성하면 되도록 설정되어 있어요. Flutter는 각 플랫폼에서 같은 것을 활용하면서 자체 엔진을 실행하며, 차이는 플랫폼 자체와의 작은 통신 레이어뿐이에요. 이는 Flutter가 빠르게 움직일 수 있고 매우 유연한 솔루션이라는 것을 의미해요. 그래서 안드로이드나 iOS가 언젠가 없어진다 해도 Flutter 사용에 큰 지장이 없을 거예요. 이외에도, Skia 렌더링 엔진에서 Compose가 사용하는 Impeller 렌더링으로 전환함으로써 다른 솔루션과 다른 차이점을 만들어 더 향상된 것이 좋았어요.\n\n동시에 기존 네이티브 플랫폼과의 상호 운용성은 때로 어려울 수 있는데, Compose Multiplatform이 활용하는 솔루션이 아주 쉽고 매끄러운 설정인 것으로 보여요. 또한, Compose Multiplatform이 가진 이점 중 하나는 이미 프레임워크 채택 시 기존 개발자 풀에서 고를 수 있다는 점이에요. 안드로이드는 여러 해 동안 Kotlin을 실행해왔고, Compose는 2021년부터 그들의 네이티브 솔루션이었기 때문에 Compose Multiplatform 및 Kotlin Multiplatform에 익숙한 개발자들이 이미 많이 존재해요.\n\n지금은 걱정할 필요가 없어요, 구글도 최근 블로그 중 하나에서 그렇다고 말하고 있어요. 하지만 개발 상황을 주의 깊게 지켜보세요. Flutter는 안전한 선택이지만 결국 치열한 경쟁이 될 수도 있어요. 하지만 결국 Flutter는 문제에 대한 해결책일 뿐이에요, 그리고 새로운 프레임워크들이 계속해서 등장해 같은 질문들을 던질 겁니다. 누가 다음 핫한 새로운 주인공이 될지 아무도 모르죠!\n\n지금까지 읽어주셔서 감사해요! 제 팔로우를 시작해주시면 정말 도움이 될 거예요 🙏 이미 했나요? 함께 해 주셔서 감사해요! 이런 기사들을 놓치고 싶지 않다면 알림을 받도록 구독해주세요.\n\n<div class=\"content-ad\"></div>\n\n열정적으로 지속하고, 배고픈 마음을 잃지 말고, 코딩을 계속해보세요 🐦","ogImage":{"url":"/assets/img/2024-06-19-IsKotlinMultiplatformkillingFlutter_0.png"},"coverImage":"/assets/img/2024-06-19-IsKotlinMultiplatformkillingFlutter_0.png","tag":["Tech"],"readingTime":4},{"title":"Flutter Appwrite  완벽한 크래시 코스","description":"","date":"2024-06-19 00:13","slug":"2024-06-19-FlutterAppwriteTheCompleteCrashCourse","content":"\n\n<img src=\"/assets/img/2024-06-19-FlutterAppwriteTheCompleteCrashCourse_0.png\" />\n\nAppwrite는 지난 몇 달 동안 점점 더 인기를 얻고있는 자체 호스팅된 백엔드 솔루션입니다. 개인 및 상업용 앱에 유용하며 훌륭한 기능을 제공합니다. 이 글에서는 Appwrite를 사용하는 방법을 배우고, Flutter에서 가장 쉽게 사용할 수 있는 백엔드 솔루션이라는 것을 확인할 수 있을 것입니다.\n\n즐거운 읽기 되세요!\n\n# 설치\n\n<div class=\"content-ad\"></div>\n\n우리 앱을 만든 후에 해야 할 첫 번째 일은 Appwrite를 추가하는 것입니다. 이를 위해 flutter pub add appwrite 명령어를 사용할 것입니다.\n\n하지만 그겣만으로 충분하지 않습니다. Appwrite는 백엔드 솔루션이기 때문에, 우리는 우리의 기계에 다운로드해야 합니다. Digital Ocean 또는 Gitpod을 사용하는 경우, 여기 있는 링크를 클릭하여 One-Click 설정을 할 수 있습니다.\n\n만약 둘 중 하나를 사용하지 않는다면, 도커를 사용하여 설치할 수 있습니다. 이곳을 클릭하여 설치할 수 있습니다. 아직 도커를 설치하지 않았다면, 이곳을 클릭하여 설치할 수 있습니다.\n\n# Appwrite 프로젝트 생성\n\n<div class=\"content-ad\"></div>\n\n이제 Appwrite 프로젝트를 설정해 봅시다. 도커 CLI가 실행 중인지 확인하여 로컬호스트를 통해 Appwrite 대시보드에 액세스할 수 있습니다. Appwrite 클라우드를 사용 중이라면 Appwrite 클라우드 대시보드로 이동해주세요.\n\n거기에서 프로젝트 생성을 클릭하세요. 지시 사항을 따르고 생성을 클릭하세요. 이제 프로젝트에 새로운 Flutter 플랫폼을 추가해야 합니다. 생성한 프로젝트에서 \"플랫폼 추가\"를 클릭하세요. Flutter를 선택하고 App 자격 증명을 추가하세요.\n\n여러 플랫폼으로 앱을 빌드하는 경우 각 플랫폼에 대해 몇 가지 단계를 수행해야 합니다. 아래 모든 링크를 참조하세요:\n\n- 안드로이드\n- iOS\n- Linux\n- macOS\n- Web\n- Windows\n\n<div class=\"content-ad\"></div>\n\n# 첫 단계 및 사용자 인증\n\n먼저 SDK를 초기화하는 것부터 시작해보겠습니다. 앱라이트 대시보드의 설정으로 이동하여 프로젝트 ID 및 엔드포인트를 확인해주세요.\n\n![image](/assets/img/2024-06-19-FlutterAppwriteTheCompleteCrashCourse_1.png)\n\nAppwrite를 가져와서 Client 유형의 새 변수를 만듭니다. 이제 엔드포인트를 설정할 수 있습니다. 로컬호스트로 설정하세요.\n\n<div class=\"content-ad\"></div>\n\n```dart\nimport 'package:flutter/material.dart';\nimport 'package:appwrite/appwrite.dart';\n\nvoid main() {\n  WidgetsFlutterBinding.ensureInitialized();\n  Client client = Client()\n    .setEndpoint(\"https://localhost/v1\") // 만약 Appwrite cloud를 사용 중이라면 https://cloud.appwrite.io/v1을 사용하세요\n    .setProject(\"<YOUR_PROJECT_ID>\");\n  \n  runApp(MaterialApp();\n}\n```\n\n자, 이제 첫 번째 요청을 보내 봅시다. 우리는 계정을 만들 것입니다. 이를 위해 account라는 새 변수를 만들고 .create()를 호출합니다. 여기에 대해 몇 가지를 지정할 수 있습니다. 그 값들은 텍스트 필드에서 가져올 수 있습니다:\n\n```dart\n// 계정 변수 생성\nAccount account = Account(client);\n\n// 새 계정 생성. 이름은 옵션입니다.\nawait account.create(\n  userId: ID.unique(), \n  email: email, \n  password: password, \n  name: name,\n);\n```\n\n하지만 이렇게 하면 계정만 생성되고 사용자가 로그인되지는 않습니다. 사용자를 로그인하려면 createEmailPasswordSession을 사용할 수 있습니다:\n\n\n<div class=\"content-ad\"></div>\n\n```dart\n// 로그인\nawait account.createEmailPasswordSession(email: email, password: password);\n\n// 사용자 정보 가져오기. 예를 들어 상태 관리에서 저장하여 나중에 접근할 수 있습니다 (예: userProvider 사용)\nfinal user = await account.get();\n```\n\n사용자를 로그아웃하려면 deleteSession()을 호출하면 됩니다 (걱정 마세요, 이 작업은 계정을 삭제하는 것이 아니라 현재 세션만 삭제합니다):\n\n```dart\nawait widget.account.deleteSession(sessionId: 'current');\n```\n\n그런데 계정을 삭제하려면 어떻게 해야 할까요? 이 작업은 그렇게 간단하지 않습니다. 왜냐하면 User API(계정 API가 아닌)와 작업해야하기 때문입니다. User API는 서버 측에서 통합되어 있으며 관리자 범위에서 작동하는 반면, Account API는 현재 로그인한 사용자의 범위에서 작동하며 일반적으로 클라이언트 측 통합을 사용합니다. Appwrite가 서버 측 Dart SDK 코드를 지원하므로 우리는 여전히 Dart 코드를 사용할 수 있지만, dart_appwrite 패키지를 추가해야 합니다. 또한 해당 함수를 배포하고 그에 대한 응답을 받아야 합니다. 이 내용은 초보자를 위한 Appwrite 튜토리얼이므로 이 부분에 대해 다루지는 않겠습니다. 하지만 기본적인 코드는 다음과 같을 것입니다:\n\n<div class=\"content-ad\"></div>\n\n```dart\nimport 'package:dart_appwrite/dart_appwrite.dart';\n\nClient client = Client()\n  .setEndpoint('https://cloud.appwrite.io/v1') // API 엔드포인트를 입력해주세요\n  .setProject('5df5acd0d48c2') // 프로젝트 ID를 입력해주세요\n  .setKey('919c2d18fb5d4...a2ae413da83346ad2'); // 시크릿 API 키를 입력해주세요\n\nUsers users = Users(client);\n\nawait users.delete(\n  // 함수에 전달된 인수를 사용자 ID로 설정해주세요\n  userId: '<사용자 ID>',\n);\n\n// 물론 응답을 반환해야 해요\n```\n\n# 데이터베이스 사용하기\n\n데이터베이스를 만들려면 프로젝트로 돌아가서 \"Database\"로 이동하세요. 거기서 데이터베이스를 만들 수 있어요. 각 데이터베이스는 콜렉션으로 나뉩니다. 앱을 위해 여러 데이터베이스를 만들 필요는 없지만, 더 큰 애플리케이션을 위해서는 권장됩니다. 콜렉션 안에서 다양한 속성을 추가할 수 있어요. 할 일 목록 애플리케이션에서는 예를 들어 날짜, 텍스트, 그리고 완료 여부를 나타냅니다. 콜렉션의 설정에서 권한을 \"문서 수준\"으로 설정하면 UserID를 따로 지정하지 않아도 됩니다. 또한, ID를 걱정할 필요도 없어요. Appwrite가 자동으로 ID를 할당하기 때문이죠 (기존에 지정한 속성이 없을 경우).\n\n하지만 이제는 당연히 데이터베이스 항목을 가져오고 싶어요. 먼저 모든 문서를 나열할 거에요:\n\n\n<div class=\"content-ad\"></div>\n\n```dart\nfinal databases = Databases(client);\n\ntry {\n  final documents = await databases.listDocuments(\n      databaseId: '<DATABASE_ID>',\n      collectionId: '[COLLECTION_ID]',\n      queries: [\n        // No queries means everything. Read more about queries here: [queries](https://appwrite.io/docs/products/databases/queries)\n      ]\n  );\n} on AppwriteException catch(e) {\n  print(e);\n}\n```\n\n컬렉션 ID는 컬렉션의 설정에서 얻을 수 있고 데이터베이스 ID는 데이터베이스의 설정에서 얻을 수 있습니다.\n\n하지만 사용자가 할 일을 클릭하고 모든 정보에 액세스하려면 어떻게 해야 할까요? 그럴 경우 한 항목만 가져와야 합니다. 이 작업도 Appwrite를 사용하면 매우 쉽습니다.\n\n```dart\ntry {\n  Document result = await databases.getDocument(\n      databaseId: '<DATABASE_ID>',\n      collectionId: '<COLLECTION_ID>',\n      documentId: '<DOCUMENT_ID>',\n  );\n} on AppwriteException catch(e) {\n  print(e);\n}\n```\n\n<div class=\"content-ad\"></div>\n\n모든 문서를 가져왔지만 사용자는 아직 문서를 생성하지 않았습니다. 그래서 지금 바로 해보겠습니다:\n\n```js\ntry {\n  Document result = await databases.createDocument(\n      databaseId: '<DATABASE_ID>',\n      collectionId: '<COLLECTION_ID>',\n      documentId: '<DOCUMENT_ID>',\n      data: {\n        \"text\": \"Go for a walk\",\n        \"done\": false,\n        // ...\n      },\n      permissions: [\"read(\"any\")\"], //permissions에 대해 더 알아보기\n   );\n} on AppwriteException catch(e) {\n  print(e);\n}\n```\n\n# 추가 읽을거리 및 결론\n\n이 글에서는 백엔드 솔루션 \"Appwrite\"의 기본을 배웠습니다. 이것이 얼마나 유용하고 사용하기 쉬운지 보았습니다. 내 의견으로는, Firebase, AWS, 그리고 Supabase 중에서 Appwrite가 가장 쉽게 사용할 수 있는 백엔드 솔루션이라고 생각합니다.\n\n<div class=\"content-ad\"></div>\n\n아래는 Appwrite의 매우 간단한 개요에 불과하며 모든 내용을 다 다루지는 않습니다. 발견할 것이 아주 많습니다. 더 고급된 기사를 원하시면 댓글을 남겨주세요!\n\n한편, Appwrite 문서를 확인해주세요: [Appwrite 문서](https://appwrite.io/docs)\n\n다음 몇 개의 글에서는 더 복잡한 패키지를 소개하고 설명하겠습니다. 이를 놓치고 싶지 않다면 저를 팔로우하는 것을 추천합니다. 누구나 이해할 수 있는 가장 쉬운 튜토리얼을 작성하기 위해 최선을 다해보았습니다. 이 작업에 감사드리며, 이 퀄리티 콘텐츠를 지원해주시고 몇 개의 박수를 보내 주시면 정말 감사하겠습니다!\n\n독자 여러분의 읽어 주셔서 감사합니다. 즐거운 하루 보내세요! 🌟","ogImage":{"url":"/assets/img/2024-06-19-FlutterAppwriteTheCompleteCrashCourse_0.png"},"coverImage":"/assets/img/2024-06-19-FlutterAppwriteTheCompleteCrashCourse_0.png","tag":["Tech"],"readingTime":6},{"title":"옵저버 디자인 패턴 - Dart","description":"","date":"2024-06-19 00:11","slug":"2024-06-19-ObserverDesignPatternDart","content":"\n\n\n<img src=\"/assets/img/2024-06-19-ObserverDesignPatternDart_0.png\" />\n\n옵저버는 행동 디자인 패턴입니다. 우리는 데이터를 변경할 때 객체에 알리는 관찰자 패턴을 사용할 수 있습니다. 객체에게 \"앗, 데이터가 변경되었어. 할 일을 해라\"고 알립니다. 이는 플러터의 ChangeNotifier와 비슷합니다. 옵저버 패턴에는 Subject와 Observer 두 가지 타입의 클래스가 있습니다. Observer 클래스는 데이터 업데이트를 기다리고 우리의 사용자 정의 로직을 실행할 것입니다. Subject 클래스는 옵저버를 저장하고 데이터를 알림하기 위해 사용됩니다.\n\n# 시작해보죠\n\n<img src=\"https://miro.medium.com/v2/resize:fit:1000/1*MRIUs1xCFX0PjO88wG1AxQ.gif\" />\n\n\n<div class=\"content-ad\"></div>\n\n먼저, Observer 클래스와 update 메서드를 생성할 겁니다. 이 메서드에 대해 구체적인 옵저버들이 알림을 받겠죠.\n\n```js\nabstract class Observer {\n  void update(bool atHome);\n}\n```\n\n이제 Observer 추상 클래스를 구현하는 구체적인 옵저버들을 만들 수 있어요.\n\n```js\nclass Kettle implements Observer {\n  @override\n  void update(bool atHome) {\n    /// 여기에 사용자 정의 로직을 작성할 수 있어요\n    if (atHome) {\n      print('물 끓이는 중');\n    } else {\n      print('주전자가 꺼졌어요');\n    }\n  }\n}\n\nclass Lights implements Observer {\n  @override\n  void update(bool atHome) {\n    /// 여기에 사용자 정의 로직을 작성할 수 있어요\n    if (atHome) {\n      print('조명 켜짐');\n    } else {\n      print('모두 조명 끔');\n    }\n  }\n}\n```\n\n<div class=\"content-ad\"></div>\n\n이제 Subject 클래스를 만들어 보겠습니다. 이것을 HomeManager라고 이름 짓겠습니다.\n\n```js\nclass HomeManager {\n  final List<Observer> _observersList = [];\n\n  /// 변경 가능한 데이터 (상태 데이터)\n  bool _atHome = false;\n\n  /// 새로운 옵서버를 목록에 추가합니다\n  void addListener(Observer observer) {\n    _observersList.add(observer);\n  }\n\n  /// 옵서버를 목록에서 제거합니다\n  void removeListener(Observer observer) {\n    _observersList.remove(observer);\n  }\n\n  /// 데이터 업데이트\n  void setData(bool atHome) {\n    _atHome = atHome;\n  }\n  \n  /// 추가된 모든 옵서버들에게 알립니다\n  void notify() {\n    for (var element in _observersList) {\n      element.update(_atHome);\n    }\n  }\n}\n```\n\n중요한 부분은 notify 메서드입니다. _observersList를 통해 반복하면서 각 옵서버 객체에 대해 update 메서드를 호출합니다. 따라서 각 옵서버는 그 데이터 변경 사항을 인식하게 됩니다. 모든 클래스를 함께 사용합시다. 주석과 함께 설명해 드렸습니다.\n\n```js\nimport 'package:observer_design_pattern/observer.dart';\n\nvoid main(List<String> arguments) {\n  HomeManager homeManager = HomeManager();\n\n  Lights lights = Lights();\n  Kettle kettle = Kettle();\n\n  /// 옵서버들을 목록에 추가합니다\n  homeManager.addListener(lights);\n  homeManager.addListener(kettle);\n\n  /// 데이터 업데이트\n  homeManager.setData(true);\n\n  /// 모든 옵서버에게 알림\n  ///\n  /// Kettle과 Lights가 트리거됩니다\n  homeManager.notify();\n\n  print('------옵서버 제거------');\n\n  /// Lights 옵서버를 제거합니다\n  homeManager.removeListener(lights);\n\n  homeManager.setData(false);\n\n  /// Kettle만 트리거됩니다\n  homeManager.notify();\n}\n```\n\n<div class=\"content-ad\"></div>\n\n여기 결과입니다:\n\n![옵저버 디자인 패턴](/assets/img/2024-06-19-ObserverDesignPatternDart_1.png)\n\n그게 다에요. 간단한 예제를 활용하여 옵저버 디자인 패턴을 설명해보았어요. 마음에 드셨으면 좋겠네요... 의견 주시면 감사하겠어요! 아래에서 작동하는 예제(소스 코드)를 찾을 수 있어요.\n\n![옵저버 패턴 예제](https://miro.medium.com/v2/resize:fit:1000/1*ufNPsZPqqgunmv1Bd2JrzQ.gif)","ogImage":{"url":"/assets/img/2024-06-19-ObserverDesignPatternDart_0.png"},"coverImage":"/assets/img/2024-06-19-ObserverDesignPatternDart_0.png","tag":["Tech"],"readingTime":3},{"title":"State Management in Flutter  외부 라이브러리 종속성 없이","description":"","date":"2024-06-19 00:11","slug":"2024-06-19-StateManagementinFlutterNoThirdPartyDependencies","content":"\n\n\n<img src=\"/assets/img/2024-06-19-StateManagementinFlutterNoThirdPartyDependencies_0.png\" />\n\n저희가 네이티브 안드로이드 앱을 플러터로 이꟮리는 작업을 시작한 이후로, 프로젝트에 관한 많은 어럽한 결정을 내려야 했습니다. 네이티브 앱을 개발할 때 한 실수를 반복하지 않기 위해서였죠.\n\nFlutter 환경에서 제공되는 모든 상태 관리 솔루션을 다뤄보고 어떤 것을 사용할지 결정해야 했습니다. 이 일은 실제로 힘들었습니다. Provider, Riverpod, Bloc, Cubit, MobX, GetX, Redux 등 다양한 옵션들이 있었기 때문이죠. 각각을 이해하는 데 많은 노력이 필요했고, 다양한 솔루션들을 읽고 시도한 뒤에 우리는 내부에서 너무 많은 마술이 일어나고 있다고 더 확신을 얻을 수 있었습니다.\n\n조사를 진행하다가, 서드파티 라이브러리 없이 상태 관리를 하는 방법을 사용하는 많은 앱들이 상점에 있다는 것을 알게되는 기사를 찾았습니다. 좀 더 조사해보니, 플러터에서 상태 관리를 아주 멋지게 구현한 다른 기사도 찾았습니다. 이러한 콘텐츠에서 영감을 받아 우리는 서드파티 라이브러리 없이 솔루션을 찾기 위해 조사를 시작했습니다. 이어서 저희가 어떻게 앱에서 플러터의 네이티브 자원만을 사용하여 상태 관리를 구현했는지 알려드릴게요.\n\n\n<div class=\"content-ad\"></div>\n\n## 앱 패턴\n\n저희는 Flutter 앱의 아키텍처로 MVVM (Model-View-ViewModel) 패턴을 선택했습니다. 네이티브 안드로이드 앱에서 편안하게 사용했던 이 패턴을 Flutter 프로젝트에도 충분히 적용할 수 있다고 확신했기 때문입니다.\n\nMVVM 패턴은 주로 세 가지 클래스로 구성됩니다:\n\n- Model: 화면에 표시할 데이터를 보유하는 클래스입니다.\n- View: Flutter에서는 이것이 화면을 나타내는 위젯입니다.\n- ViewModel: 여기에는 로직이 포함됩니다. 화면(View)과의 모든 상호작용은 ViewModel에서 메소드 호출을 일으켜야 합니다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-19-StateManagementinFlutterNoThirdPartyDependencies_1.png\" />\n\n## MVVM과 플러터 네이티브 리소스 병합하기\n\n우선적으로, 우리 예제를 구축하는 데 도움이 되는 몇 개의 클래스를 생성해야 합니다. 아래에는 우리 예제를 재현하기 위해 만들어야 하는 클래스들이 나와 있습니다:\n\n- user_dto.dart: 이 파일에는 DTO(Data Transfer Object)를 나타내는 클래스가 포함됩니다.\n\n<div class=\"content-ad\"></div>\n\n```dart\nclass UserDto {\n  final String name;\n\n  UserDto({required this.name});\n}\n```\n\n2. user_repository.dart: 이 파일은 HTTP 페치 요청을 담당하는 클래스가 위치할 것입니다.\n\n```dart\nimport 'package:teste_artigo/user_dto.dart';\n\nclass UserRepository {\n  Future<UserDto> getUserData() async {\n    // 사용자 데이터를 가져오는 시뮬레이션, API 호출일 수도 있습니다. 리포지토리 파일에 위치할 것입니다.\n    await Future.delayed(const Duration(seconds: 2), () {});\n    return UserDto(name: 'John Doe');\n  }\n}\n```\n\n그런 다음 우리는 MVVM 구조를 마칠 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\nValueNotifier과 ValueListenableBuilder를 사용하여 Model, View 및 ViewModel 간의 연결을 설정했어요.\n\n먼저 home_screen_state.dart 파일을 만들어볼게요. 각 화면에는 로딩 상태, 오류 상태, 성공 상태 등이 있습니다. 이러한 상태를 클래스 유형을 사용하여 구분할 거에요:\n\n```js\nabstract class HomeScreenState {}\n\nclass HomeScreenLoadingState extends HomeScreenState {}\n\nclass HomeScreenSuccessfulState extends HomeScreenState {\n  final String userName;\n\n  HomeScreenSuccessfulState(this.userName);\n}\n\nclass HomeScreenErrorState extends HomeScreenState {\n  final String errorMessage;\n\n  HomeScreenErrorState(this.errorMessage);\n}\n```\n\n우리는 원하는 만큼 많은 상태를 가질 수 있으며 각 상태는 필요한 변수를 가질 수 있어요. 심지어 abstract HomeScreenState 클래스 내에 공통 변수를 가질 수도 있어요.\n\n<div class=\"content-ad\"></div>\n\n다음으로, ViewModel 클래스를 생성해야 합니다:\n\n```js\nimport 'package:flutter/cupertino.dart';\nimport 'package:teste_artigo/home_screen_state.dart';\nimport 'package:teste_artigo/user_repository.dart';\n\nclass HomeScreenViewModel {\n  var state = ValueNotifier<HomeScreenState>(HomeScreenLoadingState());\n  final userRepository = UserRepository();\n\n  Future<void> onInit() async {\n    _tryToFetchUserData();\n  }\n\n  Future<void> onRefreshUserData() async {\n    _tryToFetchUserData();\n  }\n\n  Future<void> _tryToFetchUserData() async {\n    try {\n      state.value = HomeScreenLoadingState();\n      final response = await userRepository.getUserData();\n      state.value = HomeScreenSuccessfulState(response.name);\n    } catch (e) {\n      state.value = HomeScreenErrorState('An error occurred');\n    }\n  }\n}\n```\n\n이 클래스에서 우리는 공개 메서드 이름이 UI 클래스에 대한 콜백을 나타내는 것을 확인할 수 있습니다. 메서드 이름에서 사용자 데이터를 가져올 것이라는 것을 명시적으로 명시하지 않습니다.\n대신, UI가 초기화되거나 사용자 데이터를 새로 고침하길 요청할 때 특정 메서드가 호출되어야 함을 간단히 나타냅니다. 로직은 UI에서 숨어 있는 비공개 메서드인 `_tryToFetchUserData` 메서드 내부에 있습니다.\n\n또한, 데이터를 업데이트해야 할 때 적절한 상태 유형 및 매개변수와 함께 state 변수의 값을 업데이트해야 함을 알 수 있습니다.\n이 변수는 스트림입니다. 이미 변경되면 청취자에게 알리는 책임을 지고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n마지막으로 UI가 있습니다:\n\n```js\nimport 'package:flutter/material.dart';\nimport 'package:teste_artigo/home_screen_view_model.dart';\n\nimport 'home_screen_state.dart';\n\nclass HomeScreen extends StatefulWidget {\n  const HomeScreen({key});\n\n  @override\n  State<HomeScreen> createState() => _MyHomePageState();\n}\n\nclass _MyHomePageState extends State<HomeScreen> {\n  late final HomeScreenViewModel _vm;\n\n  @override\n  void initState() {\n    super.initState();\n    _vm = HomeScreenViewModel();\n    _vm.onInit();\n  }\n\n  @override\n  Widget build(BuildContext context) {\n    return Scaffold(\n      appBar: AppBar(\n        backgroundColor: Theme.of(context).colorScheme.inversePrimary,\n        title: const Text('상태 관리'),\n      ),\n      floatingActionButton: _buildFloatingActionButton(),\n      body: _buildBody(),\n    );\n  }\n\n  Widget _buildFloatingActionButton() {\n    return FloatingActionButton(\n      onPressed: () => _vm.onRefreshUserData(),\n      tooltip: '새로 고침',\n      child: const Icon(Icons.refresh),\n    );\n  }\n\n  Widget _buildBody() {\n    return Column(\n      mainAxisAlignment: MainAxisAlignment.center,\n      children: [\n        ValueListenableBuilder(\n          valueListenable: _vm.state,\n          builder: (context, state, _) {\n            switch (state.runtimeType) {\n              case HomeScreenLoadingState:\n                return const Center(child: CircularProgressIndicator());\n              case HomeScreenSuccessfulState:\n                final successfulState = state as HomeScreenSuccessfulState;\n                return Center(child: Text(successfulState.userName));\n              case HomeScreenErrorState:\n                final errorState = state as HomeScreenErrorState;\n                return Center(child: Text(errorState.errorMessage));\n              default:\n                return Container();\n            }\n          },\n        )\n      ],\n    );\n  }\n}\n```\n\nValueListenableBuilder 내에서 \"마법\"이 일어납니다: 상태의 유형에 따라 특정 위젯을 렌더링하여 표시합니다.\n\n빌더 함수는 ViewModel에서 상태 변수가 변경될 때마다 호출되므로 setState를 호출하거나 다른 작업을 걱정할 필요가 없습니다. 코드의 더 깊은 부분에서 ValueListenableBuilder를 사용하여 전체 화면을 다시 렌더링하는 것을 피할 수도 있습니다. 그러나 중요한 점은 그것이 필요하지 않다는 것입니다: Flutter는 이미 전체 화면을 렌더링하도록 최적화되어 있으며, setState를 사용하여 화면을 업데이트하도록 만들어졌기 때문에 기존에 렌더링 된 것을 다시 렌더링하는 방법을 알고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 결론\n\n이게 다에요!  별도의 외부 의존성이 없어 매우 간단해요.\n\n이것은 아주 간단한 예시라는 것을 이해합니다. 더 복잡한 화면을 만들기 시작하면 더 많은 질문이 생겨나고, 이렇게 간단한 해결책을 유지하는 것이 더 어려워질 수도 있습니다. 그러나 저희는 이 방법을 성공적으로 사용하여 매우 복잡한 화면을 만들고 있습니다 (실제로 회사의 주요 제품인 전체 앱을 Flutter로 이주 중이기도 합니다), 그리고 이 방법이 저희에게 아주 잘 작동하고 있어요.\n\n의문이 있거나 의견을 주고 싶다면, 언제든지 LinkedIn에서 제게 직접 메시지를 남겨주세요. 언제든지 대화를 나누기 위해 친절히 준비되어 있을게요.\n\n<div class=\"content-ad\"></div>\n\n이 예제의 코드는 이 저장소에서 찾을 수 있어요.","ogImage":{"url":"/assets/img/2024-06-19-StateManagementinFlutterNoThirdPartyDependencies_0.png"},"coverImage":"/assets/img/2024-06-19-StateManagementinFlutterNoThirdPartyDependencies_0.png","tag":["Tech"],"readingTime":7},{"title":"플러터에서 이미지를 다루는 일반적인 실수들","description":"","date":"2024-06-19 00:09","slug":"2024-06-19-CommonmistakeswithImagesinFlutter","content":"\n\n이미지는 대부분의 앱에서 사용하는 핵심 기능 중 하나입니다. 그러나 많은 사용자들은 간단히 피할 수 있는 실수로 응용 프로그램 성능에 부정적인 영향을 줄 수 있습니다. 몇 가지 주요 사례를 살펴보겠습니다.\n\n# 1. 대형 이미지 자산\n\n이는 많은 메모리와 처리 시간을 차지할 수 있습니다. 메모리에 디코딩된 비트맵 크기는 그들의 해상도에 직접적으로 의존하며, 이는 앱 성능에 큰 영향을 미칠 수 있습니다.\n\n## 번들화된 이미지 자산의 크기를 줄이세요\n\n<div class=\"content-ad\"></div>\n\n대부분의 스마트폰은 화면 너비가 1200 픽셀 이하이므로 자산을 그에 맞게 조절하는 것이 좋습니다. 예를 들어, 7500x5000 픽셀의 사진을 살펴보겠습니다. 이러한 크기의 비트맵을 저장하는 데 사용되는 RAM 양은 112 Mb로, 이는 Flutter의 이미지 캐시의 기본 크기를 초과합니다. 여기서의 규칙은 비트맵 크기의 합이 단일 앱 세션에 100 Mb를 초과해서는 안 된다는 것입니다. 그렇지 않으면 이미지가 다시 디코딩되어 부드럽지 않은 사용자 경험으로 이어질 수 있습니다.\n\n이미지 해상도를 1200x800으로 줄이면 비트맵 크기가 2.8 Mb로 줄어듭니다. 이러한 계산은 이 도구를 사용하여 수행됩니다.\n\n그러나 파일을 통제할 수 있는 경우에만 이렇게 할 수 있습니다. 원격 소스에서 이미지가 오는 경우에는 어떻게 해야 할까요? 또는 동일한 이미지가 다른 크기의 레이아웃에 사용될 수 있는 경우엔 어떻게 해야 할까요?\n\n## cacheWidth 및 cacheHeight 사용하기\n\n<div class=\"content-ad\"></div>\n\n위의 매개변수를 제공함으로써 이미지의 디코딩 크기를 지정할 수 있어요. 계산에 MediaQuery.of(context).devicePixelRatio를 포함하는 것을 잊지 마세요. 같은 이미지 자산이라도 cacheHeight/cacheWidth가 다르면 캐시에서 서로 다른 이미지로 간주될 거예요.\n\n```js\n    Image.asset(\n      \"assets/6392956.jpg\",\n      height: 100,\n      width: 300,\n      cacheHeight: (100 * MediaQuery.of(context).devicePixelRatio).toInt(),\n    );\n```\n\n캐시에 미치는 영향을 테스트해보려면 몇 가지 측정을 해봐요. 현재 캐시 크기에는 PaintingBinding 클래스를 통해 액세스할 수 있어요:\n\n```js\nPaintingBinding.instance.imageCache.currentSizeBytes;\n```\n\n<div class=\"content-ad\"></div>\n\n크기가 큰 이미지는 예상대로 캐시 크기가 증가합니다. 그러나 원본 이미지가 너무 크기 때문에 전혀 캐시에 추가되지 않았고, 결과적으로 이미지를 표시할 때마다 디코딩하는 문제가 발생했습니다. 어떻게 보이는지 살펴봅시다:\n\n![image](https://miro.medium.com/v2/resize:fit:576/1*HXRzZzdr7z5qeMwa4IFV6g.gif)\n\n위 동영상에서는 캐시 크기 제한을 초과하는 이미지가 포함된 화면이 열릴 때마다 지연이 발생하며, 크기가 조정된 이미지의 경우에는 화면이 처음 열릴 때만 지연이 발생합니다.\n\n# 2. WebP 자산을 사용하지 않기\n\n<div class=\"content-ad\"></div>\n\n번들된 에셋을 최적화하는 또 다른 방법은 WebP 형식을 사용하는 것입니다. 이를 이용하면 이미지 파일 크기를 크게 줄일 수 있습니다. 무료 온라인 변환 도구가 많이 있고, Flutter는 기본적으로 WebP를 지원합니다.\n\n# 3. Opacity 위젯 사용 시 필요하지 않은 경우에\n\nOpacity 위젯은 매우 유용하고 편리하지만, 우리가 원할 때마다 사용해서는 안 됩니다. 왜냐하면 사용할 때마다 새 렌더링 레이어를 생성하기 때문입니다. 이 위젯이 화면에 여러 번 포함되어 있는 경우 어떻게 되는지 살펴봅시다:\n\n```js\n    Opacity(\n      opacity: 0.5, // <- 가능한 경우 이런식으로 하지 말기\n      child: Image.asset(\n        \"assets/6392956.jpg\",\n        height: 100,\n        width: 300,\n      ),\n    );\n```  \n\n<div class=\"content-ad\"></div>\n\n그럼 개발 도구를 열어서 렌더 레이어를 확인해보세요:\n\n![image0](/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_0.png)\n\n![image1](/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_1.png)\n\n각 레이어는 독립적으로 렌더링되므로 많은 계산이 발생합니다. Opacity 위젯 대신 이미지와 색상을 혼합하는 것이 권장되는 방법이니 문서를 참고해주세요:\n\n<div class=\"content-ad\"></div>\n\n```dart\nImage.asset(\n  \"assets/6392956.jpg\",\n  height: 100,\n  width: 300,\n  color: Colors.white.withOpacity(0.5), // <- 이 부분\n  colorBlendMode: BlendMode.modulate, // <- 그리고 이 부분\n  cacheHeight: (100 * MediaQuery.of(context).devicePixelRatio).toInt(),\n),\n```\n\n이렇게 하면 모든 이미지를 동일한 렌더링 레이어에 표시할 수 있습니다:\n\n![Image](/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_2.png)\n\n# 4. 이미지 에셋을 미리 로드하지 않기\n\n\n<div class=\"content-ad\"></div>\n\n플러터는 이미지를 ImageCache에 수동으로 푸시할 수 있는 기능을 제공합니다. 한 가지 이전 이미지로 시도해 봅시다:\n\n```js\nTextButton(\n  child: const Text(\"이미지 미리 캐시\"),\n  onPressed: () async {\n    cacheSize() => PaintingBinding.instance.imageCache.currentSizeBytes.toString();\n    print(cacheSize());\n    final asset = Image.asset(\n      \"assets/6392956.jpg\",\n      height: 100,\n      width: 300,\n      cacheHeight: (100 * MediaQuery.of(context).devicePixelRatio).toInt(),\n    );\n    await precacheImage(asset.image, context); // <- 이미지 미리 캐싱\n    print(cacheSize());\n  },\n)\n```\n\n출력:\n\n<img src=\"/assets/img/2024-06-19-플러터에서이미지와관련된일반적인실수_3.png\" />\n\n<div class=\"content-ad\"></div>\n\n따라서 동일한 디코딩 크기를 갖는 이미지가 포함된 화면을 열 때 결과가 즉시 열리며 캐시에서 제거되지 않는 한 사용됩니다. 이 기술을 사용할 때 캐시의 크기가 제한되어 있음을 주의해야 합니다.\n\n# 5. 네트워크 이미지 캐싱하지 않기\n\n앱이 네트워크에서 이미지를 가져오는 경우, 매번 이러한 이미지를 로드하는 것은 의미가 없을 것입니다. 대신 cached_network_image 라이브러리나 다른 대안을 사용할 수 있습니다. 라이브러리 문서는 매우 설명이 자세히 되어 있습니다.\n\n본 글이 유용하게 읽으셨기를 바랍니다. 새로운 유익한 기술을 발견할 때마다 이를 업데이트할 것이며, 최신 정보를 얻으려면 트위터에서 저를 팔로우해주세요. 전체 코드를 읽고 싶다면 리포지토리를 확인해주세요.\n\n<div class=\"content-ad\"></div>\n\n![2024-06-19-CommonmistakeswithImagesinFlutter_4.png](/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_4.png)","ogImage":{"url":"/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_0.png"},"coverImage":"/assets/img/2024-06-19-CommonmistakeswithImagesinFlutter_0.png","tag":["Tech"],"readingTime":5},{"title":"Xcode 정리해서 MacBook을 빠르게 만들기","description":"","date":"2024-06-19 00:08","slug":"2024-06-19-CleanYourXcodeandFreeUpHardDriveSpacetoMakeYourMacBookRunFaster","content":"\n\n<img src=\"/assets/img/2024-06-19-CleanYourXcodeandFreeUpHardDriveSpacetoMakeYourMacBookRunFaster_0.png\" />\n\niOS 앱을 개발하고 Xcode가 MacBook을 느리게 만드는 걸 느끼고 있나요? 걱정 마세요! 유료 소프트웨어에 의존하지 않는 완벽한 기사를 찾았습니다. 이 안내서를 마치면 Xcode 환경을 정리하고 가치 있는 하드 드라이브 공간을 확보하여 개발 프로세스를 훨씬 빠르게 만들 수 있습니다.\n\nXcode는 iOS 앱을 개발하는 데 훌륭한 도구이지만 시간이 지남에 따라 많은 불필요한 파일을 축적하기 마련입니다. 이는 시스템을 느리게 만들고 소중한 디스크 공간을 소비할 수 있습니다. 이 기사에서는 내장된 도구와 명령어만을 사용하여 Xcode 환경을 정리하는 중요한 단계를 안내해 드리겠습니다. 유료 소프트웨어가 필요하지 않습니다!\n\n시작해보고 공간을 확보하고 성능을 개선하기 위해 안전하게 제거할 수 있는 일부 폴더를 살펴보겠습니다.\n\n<div class=\"content-ad\"></div>\n\n## 1: Xcode 로그\n\n경로: ~/Library/Developer/Xcode/iOS Device Logs\n\n시간이 지남에 따라 Xcode 로그도 많은 디스크 공간을 차지할 수 있습니다. 이 로그는 디버깅에 유용하지만 필요하지 않은 경우 안전하게 삭제할 수 있습니다. 로그 디렉토리로 이동하여 모든 로그를 삭제하세요:\n\n```js\ncd ~/Library/Developer/Xcode/iOS Device Logs\nrm -rf *\n```\n\n<div class=\"content-ad\"></div>\n\n이는 깔끔한 개발 환경을 유지하는 데 도움이 됩니다.\n\n## 2: 앱 캐시 빌드\n\n경로: ~/Library/Developer/Xcode/DerivedData\n\n프로젝트를 빌드할 때 Xcode가 파생 데이터를 많이 생성합니다. 이 데이터는 안전하게 삭제할 수 있으며 다음 프로젝트 빌드 시 다시 생성됩니다. DerivedData 디렉토리로 이동하여 모든 하위 디렉터리를 제거하세요.\n\n<div class=\"content-ad\"></div>\n\n```sh\ncd ~/Library/Developer/Xcode/DerivedData\nrm -rf *\n```\n\n이 방법을 사용하면 상당한 공간을 확보할 수 있습니다.\n\n## 3: 사용하지 않는 디바이스\n\n경로: ~/Library/Developer/CoreSimulator/Devices\n\n\n<div class=\"content-ad\"></div>\n\nXcode를 사용하면서 시간이 지남에 따라 테스트 목적으로 많은 시뮬레이터 장치가 생성됩니다. 이러한 시뮬레이터 중 많은 것들이 더 이상 사용되지 않으며 안전하게 삭제할 수 있습니다. 사용되지 않는 시뮬레이터를 삭제하려면 터미널을 열고 다음 명령어를 실행하십시오:\n\n```js\nxcrun simctl delete unavailable\n```\n\n이 명령어를 실행하면 더 이상 필요하지 않은 시뮬레이터를 삭제하여 하드 드라이브 공간을 확보할 수 있습니다.\n\n## 4: 오래된 장치 지원 파일\n\n<div class=\"content-ad\"></div>\n\n경로: ~/Library/Developer/Xcode/iOS DeviceSupport\n\niOS 기기를 MacBook에 연결하면 Xcode가 해당 기기의 지원 파일을 저장합니다. 이러한 파일은 여러 기기를 연결하거나 iOS 버전을 업데이트한 경우 특히 빠르게 증가할 수 있습니다. 지정된 경로로 이동하여 더 이상 필요하지 않은 이전 iOS 버전과 관련된 디렉토리를 수동으로 삭제하세요.\n\n예를 들어, 더 이상 해당 iOS 버전을 대상으로 하지 않는 경우 9.0.0과 같이 명명된 폴더를 안전하게 삭제할 수 있습니다.\n\n## 5: 불필요한 캐시 파일\n\n<div class=\"content-ad\"></div>\n\n테이블 태그를 Markdown 형식으로 변경해보세요.\n\n<div class=\"content-ad\"></div>\n\n## 6: 불필요한 아카이브\n\n경로: ~/Library/Developer/Xcode/Archives\n\nXcode에서 빌드를 아카이브할 때마다, 해당 아카이브는 Archives 디렉토리에 저장됩니다. 이러한 아카이브는 빠르게 누적되어 많은 공간을 차지할 수 있습니다. 이를 정리하려면, Archives 디렉토리로 이동하여 더 이상 필요하지 않은 이전 아카이브를 모두 또는 선택적으로 삭제하십시오:\n\n```bash\ncd ~/Library/Developer/Xcode/Archives\nrm -rf *\n```\n\n<div class=\"content-ad\"></div>\n\n이 작업을 수행하면 빌드를 자주 아카이브하는 경우 상당한 공간을 절약할 수 있습니다.\n\n## 7: 기타 불필요한 파일\n\n경로: ~/Library/Caches/..\n\n캐시 디렉토리에는 Xcode를 포함한 다양한 애플리케이션의 캐시된 파일이 저장됩니다. 이러한 파일을 지우려면 캐시 디렉토리로 이동하여 모든 하위 디렉토리를 제거하세요:\n\n<div class=\"content-ad\"></div>\n\n```sh\ncd ~/Library/Caches\nrm -rf *\n```\n\n이 단계를 따르면 MacBook에서 중요한 공간을 확보할 수 있고 Xcode를 원할하게 실행할 수 있습니다. 이 방법들은 모두 무료이며 기본 도구를 사용하기 때문에 별도의 소프트웨어를 다운로드할 필요가 없습니다. 유료 소프트웨어가 필요하지 않습니다. 이미 Mac에서 사용할 수 있는 도구들만 있으면 됩니다! 즐겁게 코딩하고 더 빠르고 효율적인 개발 경험을 즐기세요!","ogImage":{"url":"/assets/img/2024-06-19-CleanYourXcodeandFreeUpHardDriveSpacetoMakeYourMacBookRunFaster_0.png"},"coverImage":"/assets/img/2024-06-19-CleanYourXcodeandFreeUpHardDriveSpacetoMakeYourMacBookRunFaster_0.png","tag":["Tech"],"readingTime":3},{"title":"플러터를 인정하지 않는 구글","description":"","date":"2024-06-19 00:06","slug":"2024-06-19-GoogleDoesntAppreciateFlutter","content":"\n\n또 하루, 또 하나의 \"Google이 Flutter를 제거할까?\" 글이 올라왔어요. 이젠 거의 유쾌하다고 해야하나요?\n\n이전에 Flutter에 대한 생각을 표현한 적이 있습니다. 그것은 단순히 실패하기에는 너무 크다고 생각해요. 하지만 구글이 정말 Flutter를 제대로 인정해주는지는 장담하기 어렵네요.\n\n요게 좀 어이없는 글인데요, 제가 거의 홍보글 같다고 생각할 정도거든요. 왜냐하면 Google IO는 여러 개의 키노트로 이루어져 있으며 Flutter만큼 Google이 진지하게 다뤄야 할 프로젝트는 아니기 때문이죠.\n\n하지만 눈에 띈 것은 이 부분이었어요: \"Gemini Flash 1.5 통합 예제를 본 결과, JavaScript, Python, Kotlin, Swift 예제는 있었지만 Dart나 심지어 Go는 없었어요\"\n\n<div class=\"content-ad\"></div>\n\n얼마 전에 Firebase가 너무 비싸다고 말한 글을 썼었죠. 대안을 찾고 있었어요. Firebase 글에서는 Supabase에 대해 이야기했어요. 그리고, 네, Supabase는 정말 흥미로운 대안이에요. 하지만 저는 PocketBase도 살펴보고 있어요.\n\nPocketBase를 사용하는 사람들이 정말 좋아하는 것 같아요. 그리고 이 프로젝트는 정말 작고 효율적이에요. PocketBase의 전체 실행 파일은 13MB밖에 안 됩니다. 13MB보다 큰 글꼴도 많이 있죠. 이렇게 작은 크기에 전체 백엔드를 얻을 수 있다는 게 정말 놀랍네요. 그리고 다른 백엔드에 비해 아주 적은 메모리를 차지하고 있어요.\n\n어쨌든, 내 요구 사항을 충족하는 백엔드를 찾는 평가 과정 중에 이 백엔드가 무엇을 할 수 있는지 확인해봐야 해요. 제가 주로 필요로 하는 것은 다음과 같아요: 인증, 클라우드 함수, 실시간 리스너, 그리고 오프라인 기능입니다. 실시간 리스너와 오프라인 기능을 모두 지원하는 데이터베이스를 찾는 건 의외로 힘들어요. 아마 제가 오프라인을 직접 구현해야 할 것 같아요. 그러면 인증, 실시간 리스너, 그리고 클라우드 함수만 있으면 충분할 것 같아요.\n\n아, 그리고 충돌 보고와 푸시 알림도 있지만, 무료로 사용할 수 있는 Crashlytics와 Firebase Messaging을 계속 사용해야 할 것 같아요.\n\n<div class=\"content-ad\"></div>\n\n저는 Supabase와 PocketBase 둘 다 살펴봤어요. 둘 다 제가 원하는 기능을 갖추고 있더라구요. 오프라인을 지원하지 않는다는 게 좀 아쉽긴 한데, 아마 제가 직접 구현해야할 것 같아요. 근데 문서를 살펴보니 흥미로운 점이 있더라구요. Supabase는 이렇고요:\n\n![Supabase image](/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_0.png)\n\n그리고 PocketBase는 이렇습니다:\n\n![PocketBase image](/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_1.png)\n\n<div class=\"content-ad\"></div>\n\n코드 예시에 Dart가 포함되어 있다는 건 놀라운 일이에요. 왜냐하면 제가 예전에는 Flutter 개발자만이 중요하게 여기는 작은 언어로만 알고 있었거든요. Flutter 개발자 수가 많지 않다고 생각했거든요. 사실, Flutter를 배우기 전까지는 Dart라는 언어를 들어본 적이 없었어요.\n\n다른 회사들도 자사의 문서에서 Dart를 언급한다는 소문을 들었어요. 대기업인 RevenueCat와 Google 등이 말이에요. 두 개나 세 개의 코드 예시만 나열된 페이지에서 Dart가 포함되어 있다는 건 예상 밖인 일이었어요.\n\n아니면, Dart를 사용하는 프레임워크가 생각보다 많았거나 Flutter가 놀랍도록 인기가 많은 것일지도 몰라요.\n\n저는 Flutter가 절대 멸망하지 않을 거라고 의심스러웠거든요... 제트팩 컴포즈가 인기를 얻기 전까진요. 왜냐하면 제트팩 컴포즈는 Flutter에서 많이 영감을 받았거든요. 사실, 코틀린을 사용하는 Flutter 정도라고 할 수 있어요. 근데 문서엔 코틀린이나 자바라는 언어가 언급되지 않는 거죠. 양쪽 모두 없다니까요. 겨루기 보단 함께 성장하는 게 좋죠. 좀은 경쟁이 되겠네요. 😉\n\n<div class=\"content-ad\"></div>\n\n음, 그리고 'Appwrite'라는 세 번째 백엔드도 있더라구요. 이상한 가격 정책 때문에 사용할 계획은 없고 많이 언급되지 않는 것 같아요. 하지만 그 문서에서 플러터(Flutter)와 코틀린(Kotlin)도 언급한다고 해요.\n\n![이미지](/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_2.png)\n\n그런데 플러터에 모든 주목을 받는 것에도 불구하고, 구글이 그들이 손에 쥔 것을 정말로 가치 있게 여기지 않는 것 같아요. 개발자 기조를 보는데, 그들은 플러터에 대해 이야기하기 시작한 건 45분 정도가 지난 후였어요. 그리고 이야기를 시작하자마자 2분도 안 되어 씩 간단히 소개하고 그 이후에 새로운 파이어베이스 로고가 얼마나 멋지다고 말하기 시작했어요.\n\n![이미지](/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_3.png)\n\n<div class=\"content-ad\"></div>\n\n플러터가 계속해서 코틀린 멀티플랫폼에 대해 이야기할 때 플러터가 충분한 시간을 얻지 못한 것 같아요. 계속해서 그 내용을 살펴보고 있었는데, “코틀린 멀티플랫폼에 대해 아직도 이야기를 다 끝내지 않았나요?”라고 생각했어요. 그 내용을 다루는데 더 많은 주목을 받은 것은 Gemini 뿐이에요.\n\n그래, Gemini는 멋지긴 한데, 이에 대해 많은 시간을 할애해야 한다고는 생각하지 않아요. 특히 Gemini가 하는 대부분의 것들이 그다지 인상적이지 않다는 점에서요.\n\nGemini가 Firebase Cloud Functions 로그를 설명하도록 하는 버튼이 있는 건 알고 계시나요? 그리 유용하지 않아요. 제가 경고를 설명하도록 요청했는데, 경고에 대한 정보를 알려줄 줄 알았는데 아니었어요. 대신 그 경고를 발생시킨 IP 주소만 알려주더라구요.\n\n그리고 Gemini는 아직도 주요 환각 문제를 가지고 있어요. 심지어 AI 환각으로 인한 취약점까지 생겼다고 하더라구요.\n\n<div class=\"content-ad\"></div>\n\n아마 그렇게 나쁘지는 않았습니다. 지난 해에 플러터에 더 많은 시간을 할애했고, 플러터 3.22의 변경 사항은 그다지 놀라운 것이 아닙니다. 대부분 웹 어셈블리와 성능 개선 뿐이에요. 하지만 그 성능 개선은 상당히 인상적입니다. iOS의 GPU 사용량과 전력 소비가 50% 감소했다고요? 그렇죠.\n\n그리고 웹 어셈블리? 저는 웹 어셈블리에 대해 진지한 우려가 있어서 여기서 논의했습니다. 또한 플러터 문서를 찾다가 이것을 보았어요:\n\n![이미지](/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_4.png)\n\niOS에서 무슨 문제인지 잘 모르겠네요. 모바일 Safari는 웹 어셈블리를 지원해야할 텐데 말이죠. 아마도 웹 GC(가비지 컬렉션) 관련 문제일까요? 어쨌든, iOS에서 지원하지 않는다면 큰 문제가 될 겁니다.\n\n<div class=\"content-ad\"></div>\n\n그래도 Flutter는 더 많은 관심을 받아야 한다고 생각해요. 특히 개발자 키노트 전체에서 가장 큰 반응을 얻었을 때에. 구글 I/O 전체에 이루어진 것 같아요, 비록 전부 다는 보지 않았지만 말이에요.\n\n그냥 구글이 Flutter를 충분히 인정하지 않는 것 같아요.\n\n사람들은 종종 묻곤 해요, \"만약 구글이 Flutter를 포기한다면 어떻게 될까?\" 제 의견은 이미 알려졌죠. 그렇게 될 것 같진 않다고 생각해요. 하지만 구글이 Flutter를 포기한다 해도 그것은 Flutter를 없애지 않을 거에요. 그만큼 Flutter는 크고 이미 많은 팬들을 가지고 있거든요. 이렇게 말이에요.\n\n개발자 커뮤니티에 이미 너무 깊게 뿌리내린 것 같아요. 도큐먼트가 어디서든 찾아볼 수 있어요. Swift나 Kotlin, Java 도큐먼트보다 더 많은 Dart 도큐먼트가 있어요. Flutter는 이미 인정받았어요.\n\n<div class=\"content-ad\"></div>\n\nGoogle이 Flutter를 계속 추구할 가치가 없다고 결정하더라도 다른 누군가가 계속해서 작업을 이어나갈 것이라고 확신해요. 많은 사람들에게 너무 중요한 프로젝트이기 때문이죠.","ogImage":{"url":"/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_0.png"},"coverImage":"/assets/img/2024-06-19-GoogleDoesntAppreciateFlutter_0.png","tag":["Tech"],"readingTime":5}],"page":"20","totalPageCount":21,"totalPageGroupCount":2,"lastPageGroup":20,"currentPageGroup":0},"__N_SSG":true}